{
  "cognitive": 
  {
    "title": "Cognitive",
    "subtitle": "Accessibility",
    "letter": "C",
    "intro": 
    {
      "p": "Cognitive accessibility covers every user having difficulties to read, write and/or concentrate. He may use ad/image blockers or other noise reducing tools and/or custom styles to overwrite the default styles. <a href=\"http://www.dyslexia-international.org/wp-content/uploads/2016/04/DI-Duke-Report-final-4-29-14.pdf\">According to Dislexia International</a> more than one out of 10 people and <a href=\"http://www.adhd-institute.com/burden-of-adhd/epidemiology/\">according to the ADHD Institute</a> ~6% of all children and ~3% of all adults have Attention Deficit Disorders. Accessibility in general but especially the cognitive accessibility improves general usability."
    },
    "sections": 
    [
      {
        "title": "Headings",
        "paragraphs": 
        [
          {
            "li": "Since people with cognitive disabilities are distracted very fast, it is important that the main contents’ headline has a distinct visual style that invites the user to look at the main content first."
          },
          {
            "li": "Headings should have a different style than normal text or buttons, they should also serve as visual anchors and structuring elements."
          }
        ]
      },
      {
        "title": "Tables",
        "paragraphs": 
        [
          {
            "li": "Keep your tables as simple as possible. If you have complex data, use several tables instead of one to represent it."
          },
          {
            "li": "To reduce confusion: give each element its own cell. Give table data a different look to table headings."
          },
          {
            "li": "Zebra tables is a good idea for longer tables so that the user don’t get lost.",
            "pre": ".table-row:nth-child(2n) {\n  background-color: rgba(0, 0, 0, 0.5);\n}",
            "preLang": "css"
          }
        ]
      },
      {
        "title": "Text / Typography",
        "paragraphs": 
        [
          {
            "li": "A somewhat recent <a href=\"http://dyslexiahelp.umich.edu/sites/default/files/good_fonts_for_dyslexia_study.pdf\">study</a> has proven that sans-serif, roman and monospaced fonts have the best readability on screen while italic sonts decrease the readability. What roman and monospaced fonts have in comon is that usually they usually have letters of larger size and their letters differ stongly from each other; their characters (i.e. b, d, q, p) are not just flipped versions of each other. So it is adviced to use sans-serif, roman or monospaced fonts for copy text, that ideally have distinct characters."
          },
          {
            "li": "As the user might replace your styles with custom stylesheets, you should avoid using text within images and avoid using <code>!important</code> in your css files."
          },
          {
            "li": "The main text should be aligned on the left (in left-to-right languages)."
          },
          {
            "li": "<code>font-size</code> should not be smaller than 12pt and Lines of text not wider than 60-80 characters (helps users that have trouble keeping their place when reading long lines of text)."
          },
          {
            "li": "Justified text should be avoided. Justifications create more unconsistant whitespace wich is a real problem for people with dislexia and a headache for everyone else. In some extreme cases lines seem to move around. Moreover, different Browsers treat justifications differently which gives you no control over your text."
          },
          {
            "li": "Also centered text is hard to read for people with cognitive disabilities and should be avoided."
          },
          {
            "li": "While sentences should be kept short: 10-15 words a sentence is likely to be comfortable, paragraphs can be somewhat longer: around 5 sentences long is considered easy to read."
          },
          {
            "li": "Pure white on pure black will cause text to blur for people with cognitive disabilities. Use off-black text on an off-white background. This website uses <code>#191919</code> black and <code>#F6F6F6</code> white."
          }
        ]
      },
      {
        "title": "Navigation",
        "paragraphs": 
        [
          {
            "li": "The navigation should not change while navigating the website. It helps the user orientate."
          },
          {
            "li": "The navigation should be as simple as possible and clearly indicate the current position (not only with color)."
          },
          {
            "li": "If there are many items a vertical menu should be preferred since it is easier to read one item a time. Often the main navigation is horizontal and the secondary vertical. Make sure, that the space between the links is high enough"
          },
          {
            "li": "Vertical menus are usually positioned left near to the content while horizontal menus usually start on the top left."
          },
          {
            "li": "The website should be logically usable with the browsers back and forth buttons."
          },
          {
            "li": "Items containing a submenu should be marked in a way that is obvious. I.e. an arrow pointing down. A <a href=\"https://www.viget.com/articles/testing-accordion-menu-designs-iconography\">study</a> has shown that icons placed on the left are understood faster."
          },
          {
            "li": "Also centered text is hard to read for people with cognitive disabilities and should be avoided."
          },
          {
            "li": "Thorough the whole website, all pages should have elements that are consistent: the overall look and feel, the global navigation and a consistent presentation of information."
          },
          {
            "li": "Lastly, clearly indicate the hover/focus state, the items should change so that users know exactly where they are."
          }
        ],
        "subs":
        [
          {
            "title": "In-page navigation",
            "paragraphs":
            [
              {
                "li": "Is a good practice for longer text to have some kind of table of content. It helps the user to orient themselves, to quickly find the content they want and to be able to socially share the exact right part of the website."
              },
              {
                "li": "If possible, give a visual clue that there are anchorpoints. I.e. on this website they are indicated by anchor symbols."
              }
            ]
          },
          {
            "title": "Breadcrumbs",
            "paragraphs":
            [
              {
                "li": "It is a good practice to provide breadcrumbs on websites that have more than one or two levels of navigation."
              },
              {
                "li": "Links in a breadcrumb navigation show a trail from the front page to the current page, with a link to every page on the way. Usually separated by arrows. The current page should not be linked and be the last item in the list."
              }
            ]
          },
          {
            "title": "Sitemap & Search",
            "paragraphs":
            [
              {
                "li": "Providing a sitemap is usually a good practice on large websites. It can help users to understand what the site contains and how content is organized. It should list all links and their relation. A good example it the <a href=\"https://www.w3.org/WAI/sitemap.html\">WAI Sitemap</a>."
              },
              {
                "li": "The possibility to search for content on your website should almost always be available. It helps users to find content and is often more efficient than going through the navigation. The ideal search provides suggestions that allows synonyms and spell-checks."
              }
            ]
          }
        ]
      },
      {
        "title": "Images & Patterns",
        "paragraphs":
        [
          {
            "li": "Avoid text on patterns, no matter how sublte the pattern is. It makes it more difficult to see the words shape."
          },
          {
            "li": "Adding meaningful images, that add value to the content, break long sections and give visual markers to quickly find meaningful content is a good idea."
          },
          {
            "li": "Adding icons to navigation elements can help dislexic users as well, so they don’t have to read text to find what they are looking for."
          },
          {
            "li": "Animated images are strongly distracting for everyone. They can be a complete turnoff for people with dyslexia. So, they should only be used very carefully. The best solution is to give your users the control over such elements by only playing the animation when requested. For <code>.gif</code> images, <a href=\"https://github.com/krasimir/gifffer\">gifffer</a> is a usefull tool. Otherwise, give your animated images enough space from the content so that they can be hidden by scrolling further down."
          },
          {
            "li": "Remember that complex images can be difficult to understand by many people. So, providing long descriptions benefits many people and thus is a good practice. However, if it is possible to reduce your images complexity, do it.",
            "pre": "<figure role=\"group\">\n  <img src=\"chart.png\" alt=\"Pie chart showing ethnic groups in london, described in detail below.\"\n    longdesc=\"#chart-longdesc\">\n  <figcaption id=\"chart-longdesc\">\n    <h2>Values</h2>\n    <table>\n      [...]\n    </table>\n  </figcaption>\n</figure>",
            "preLang": "markup"
          }
        ]
      },
      {
        "title": "Advertisements & Sound",
        "paragraphs":
        [
          {
            "li": "Generally, sound should not play automatically. Give the user the choice to enable/disable sound."
          },
          {
            "li": "Advertisements should be static. If they are not, the animation should not loop."
          },
          {
            "li": "Add it in a way that a user can hide it by scrolling up or down (below the fold). Then, the ad should be the only thing on that line."
          }
        ]
      },
      {
        "title": "Forms",
        "paragraphs":
        [
          {
            "li": "If filling out long forms, the progress should be auto saved or saveable. Users might take very long and get distracted a lot and might finish up another day."
          },
          {
            "li": "Consider breaking very long forms in smaller steps. If you do so, indicate the current progress in the <code>title</code>, <code>heading</code> and add a progress bar or step indicator to indicate the current position. It is a good idea that the user is able to navigate the different steps."
          },
          {
            "li": "Provide inline instructions when necessary.",
            "example":
            {
              "pre": "<label id=\"expLabel\" for=\"expire\">Expiration date:</label>\n<span>\n    <input type=\"text\" name=\"expire\" id=\"expire\" aria-labelledby=\"expLabel expDesc\">\n    <span id=\"expDesc\" tabindex=\"-1\">(MM/YYYY)</span>\n</span>",
              "preLang": "markup"
            }
          },
          {
            "li": "Make sure that you have accessible labels as introduced in <a href=\"visual.html#Labels\">visual accessibility</a>."
          }
        ],
        "subs":
        [
          {
            "title": "Placeholders",
            "paragraphs":
            [
              {
                "li": "While placeholders are very helpful, they are not replacements for labels. Also, make sure to clearly differentiate placeholders from user input as users might also confuse placeholders with pre filled input"
              },
              {
                "li": "Do not repeat the labels as placeholders. I.e. instead of <code>email: [email]</code>, rather provide an example like <code>email: [example@email.com]</code>"
              }
            ]
          },
          {
            "title": "Errors",
            "paragraphs":
            [
              {
                "li": "Provide an error/success feedback while typing or on blur (when focus of that particular element is lost). Sometimes a feedback while typing is nescessary but as it might be distracting, a feedback on blur is preferable."
              },
              {
                "li": "It has become standard to add an asterisk (*) to required fields. This asterisk should be explained somewhere. Alternatively just add the keyword “required”."
              },
              {
                "li": "Users should be able to check their own input and correct it if necessary."
              },
              {
                "li": "Show errors not only with colors. I.e. add a big border around fields with errors or a checkmarc for success and a cross or exclamation mark on errors."
              },
              {
                "li": "Have a summary of all errors on top of the page as a list. Explaining the error and ideally linking to the respective fields. This way the errors are not overseen. That there were errors should also be indicated in the pages title."
              }
            ]
          },
          {
            "title": "Anti-Spam",
            "paragraphs":
            [
              {
                "li": "As a general usability rule, try to avoid active anti-spams whenever possible."
              },
              {
                "li": "If you use captchas make sure to also provide voice checks and add an alternative way to still reach the goal even if the captcha fails. I.e. an email address for direct contact."
              },
              {
                "li": "Simple tests as “write ‘Hello World’ into this field:” are o.k. just make sure not to ask for things a person with disabilities could not answer i.e. asking for colors."
              },
              {
                "li": "Always make sure that your anti spam solutions are usable for everyone. Google did an <a href=\"http://simplyaccessible.com/article/googles-no-captcha/\">o.k. job</a> with their <a href=\"https://www.google.com/recaptcha/intro/index.html\">newest captcha</a>."
              }
            ]
          },
          {
            "title": "Labels",
            "paragraphs":
            [
              {
                "li": "As a general usability rule, try to avoid active anti-spams whenever possible."
              },
              {
                "li": "If you use captchas make sure to also provide voice checks and add an alternative way to still reach the goal even if the captcha fails. I.e. an email address for direct contact."
              },
              {
                "li": "Simple tests as “write ‘Hello World’ into this field:” are o.k. just make sure not to ask for things a person with disabilities could not answer i.e. asking for colors."
              },
              {
                "li": "Always make sure that your anti spam solutions are usable for everyone. Google did an <a href=\"http://simplyaccessible.com/article/googles-no-captcha/\">o.k. job</a> with their <a href=\"https://www.google.com/recaptcha/intro/index.html\">newest captcha</a>."
              }
            ]
          }
        ]
      },
      {
        "title": "Instructions",
        "paragraphs":
        [
          {
            "li": "Instructions should be kept as clear and as short as possible and available at any time."
          },
          {
            "li": "They should be formatted as a list and important information should be highlighted."
          },
          {
            "li": "If a website has instructions as a video, they should also be written down. Some users have issues with audiovisual content while other find it easier than textual content."
          }
        ]
      },
      {
        "title": "Testing & ressources",
        "paragraphs":
        [
          {
            "p": "Found an error or have an addition? Please <a href=\"https://github.com/ThibaultJanBeyer/learn-accesibility/blob/master/CONTRIBUTE.md\">contribute</a> to this project via github."
          },
          {
            "li": "Sadly we could not find any testing tools for cognitive accessibility. However, as most of the rules to improve cognitive accessibility are the same than the rules for usability of a website, it is adviced to gather information on general usability. Start by looking at the references below."
          },
          {
            "li": "References/Ressources used to write this page: <a href=\"https://www.amazon.com/Accessibility-Handbook-Katie-Cunningham-ebook/dp/B0092UB21U/\">Accessibility Handbook</a>, <a href=\"http://simplyaccessible.com/article/googles-no-captcha/\">Simply Accessible</a>, <a href=\"https://www.nngroup.com/articles/\">Nielsen Norman Group</a>, <a href=\"http://webaim.org/\">Webaim</a>, <a href=\"https://www.w3.org/WAI/tutorials/\">WAI Tutorials</a>, <a href=\"http://uxmovement.com/\">uxmovement</a>, <a href=\"http://www.uxmatters.com/\">usmatters</a> <a href=\"http://www.dyslexia-reading-well.com/dyslexia-font.html\">Dislexia Reading Well</a>, <a href=\"https://bdatech.org/\">BDA-Tech</a>, <a href=\"http://dyslexiahelp.umich.edu/sites/default/files/good_fonts_for_dyslexia_study.pdf\">Study: good fonts for dislexia</a>, <a href=\"https://uxmag.com/\">UX Magazine</a>, <a href=\"http://uxmyths.com/\">uxmyths</a>, <a href=\"http://ux.stackexchange.com/\">ux.stackexchange</a>, <a href=\"https://www.reddit.com/r/userexperience/\">Reddit</a>."
          },
          {
            "p": "Open up the web for everyone!"
          },
          {
            "p": "}&#x3C;)))*&#x3E;"
          }
        ]
      }
    ]
  }
}
