{
  "vision":
  {
    "title": "Low vision",
    "subtitle": "& Color Accessibility",
    "letter": "L",
    "intro": 
    {
      "p": "Low vision and color accessibility covers every user that has a lower eyesight than average (glasses don’t help or are not worn) and/or sees colors differently. He may adjust the settings of his monitor, might use a screen magnifier or custom stylesheet but is not using a screen reader. <a href=\"http://www.euroblind.org/resources/information/\">According to the EBU</a> more than 4% of the european population is blind or partially sighted and <a href=\"http://webvision.med.utah.edu/book/part-viii-gabac-receptors/color-perception/\">according to Webvision</a> ~8,5% of the US population is affected by colorblindness. Compared to a city that would be more than three times the population of New York. This section focuses on the partially sighted wo don’t use a <a href=\"visual.html\">screen reader</a> and the colorblind. There are different types color blindness:",
      "table":
      {
        "caption": "types of color blindness",
        "heads": 
        [
          "type",
          "what is it",
          "percentage"
        ],
        "rows":
        [
          [
            "Deuteranopia",
            "Red and Green appear similar, but same intensity.",
            "~1.5%"
          ],
          [
            "Deuteranomaly",
            "Greens are muted.",
            "~5.4%"
          ],
          [
            "Monochromasy",
            "All colors are affected, user see dimmed colors or only shades of gray and has a very poor vision.",
            "&#x3C;1%"
          ],
          [
            "Protanomaly",
            "Reds are less intense and might appear black.",
            "~1%"
          ],
          [
            "Protanopia",
            "Red and Green appears similar. Some colors appear more intense than normal.",
            "~1%"
          ],
          [
            "Tritanopia & Tritanomaly",
            "Blue and Yellow appear similar.",
            "&#x3C;1%"
          ]
        ]
      }
    },
    "sections": 
    [
      {
        "title": "Basics",
        "paragraphs":
        [
          {
            "li": "Make sure that your images are of adequate resolution."
          },
          {
            "li": "Your website should be responsive."
          },
          {
            "li": "Always have in mind that some users cannot differenciate/see colors."
          }
        ]
      },
      {
        "title": "Images",
        "paragraphs":
        [
          {
            "li": "Users might zoom into the page to see details in visual elements, so make sure that your images are of adequate resolution. Find a good balance between loading time and resolution. Compress your images i.e. with <a href=\"https://tinypng.com/\">tiny png</a>. It might also be helpful to <a href=\"https://en.wikipedia.org/wiki/Lazy_loading\">lazyload</a> your graphical ressources or to use different images based on the window size."
          },
          {
            "li": "If you have a layer of text ontop of your images, make sure that the contrast does not solely rely on colors. Some contrasts might be perfect for us but are a nightmare for color blind users:",
            "imgs":
            [
              {
                "src": "assets/img/examples/vision/images1_0.png",
                "alt": "Reg on Green contrast.",
                "caption": "Users with <code>Deuteranopia</code> will have difficulties with red on green and vice versa."
              },
              {
                "src": "assets/img/examples/vision/images1_1.png",
                "alt": "Reg on Green contrast.",
                "caption": "Also users with <code>Protanopia</code> will have difficulties with red on green and vice versa."
              },
              {
                "src": "assets/img/examples/vision/images1_2.png",
                "alt": "Blue on Yellow contrast.",
                "caption": "Users with <code>Tritanopia</code> will have difficulties with a blue and yellow combination."
              },
              {
                "src": "assets/img/examples/vision/images1_3.png",
                "alt": "Green on Blue with the same brightness.",
                "caption": "For users with <code>Monochromacy</code> colors with simmiliar brightness will blend."
              }
            ]
          },
          {
            "li": "Always have in mind that some people cannot differenciate/see colors."
          }
        ]
      },
      {
        "title": "Section2",
        "paragraphs":
        [
          {
            "p": "dolor sit"
          },
          {
            "img": "only img"
          }
        ],
        "subs":
        [
          {
            "title": "test2"
          }
        ]
      }
    ]
  }
}
